## PANDAS DATAFRAME OPERATIONS

##### Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [1]:
# Import pandas
import pandas as pd

#### So As a first step, we'll create a dataframe

In [2]:
#Creating a list of string
list = ['Girlscript', 'winter', 'of', 'contributing']

#Calling dataframe constructor
df = pd.DataFrame(list)
print(df)

              0
0    Girlscript
1        winter
2            of
3  contributing

#### Now we'll create a dataframe using 2 columns using dictionary

In [10]:
list = {'Language': ['Python', 'Java', 'JavaScript', 'HTML'],
        'Ranking' : ['1', '2', '3', '4']}

df = pd.DataFrame(list)
print(df)

     Language Ranking
0      Python       1
1        Java       2
2  JavaScript       3
3        HTML       4

#### Selecting columns

In [11]:
# We will use the previous column and select only language
print(df)

     Language Ranking
0      Python       1
1        Java       2
2  JavaScript       3
3        HTML       4

In [12]:
print(df['Language'])

0        Python
1          Java
2    JavaScript
3          HTML
Name: Language, dtype: object

In [13]:
df

     Language Ranking
0      Python       1
1        Java       2
2  JavaScript       3
3        HTML       4

#### Deleting column

In [14]:
#In the next line we delete the ranking column
df = df.drop(columns = ['Ranking'])
df

     Language
0      Python
1        Java
2  JavaScript
3        HTML

#### Adding new columns

In [15]:
IDE = {'Pycharm': 'Python', 'IntelliJ' : 'Java',
        'Sublime Text' : 'JavaScript', 'Sublime Text2': 'HTML'}

df['IDE'] = IDE

df

     Language            IDE
0      Python        Pycharm
1        Java       IntelliJ
2  JavaScript   Sublime Text
3        HTML  Sublime Text2

#### Now we read the dataset using pandas

In [16]:
df = pd.read_csv ('Social_Network_Ads.csv')
df

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [20]:
#To extract only one column
purchased = df["Purchased"]
print(purchased)

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [25]:
#To get the data of desired row

row_data = df.iloc[3] 
row_data

Age                   27
EstimatedSalary    57000
Purchased              0
Name: 3, dtype: int64

In [26]:
# isnull() function is used to check the null values
#It shows false which means that data doesn't contain null value

df.isnull()

       Age  EstimatedSalary  Purchased
0    False            False      False
1    False            False      False
2    False            False      False
3    False            False      False
4    False            False      False
..     ...              ...        ...
395  False            False      False
396  False            False      False
397  False            False      False
398  False            False      False
399  False            False      False

[400 rows x 3 columns]

In [29]:
import numpy as np

dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
 
# filling missing value using fillna()  
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [30]:
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
   
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [31]:
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
 
# using dropna() function  
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [32]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [33]:
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object